In [16]:
import numpy as np
import pandas as pd

In [17]:
s = pd.Series([1,3,5,np.nan,6,8])

In [20]:
er = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index = list("123"), columns = list("abc"))
er

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [12]:
df = pd.DataFrame(
    {"a":[4,5,6],   #가로축(인덱스), 해당 열 값
     "b":[7,8,9],
     "c":[10,11,12]},
     index=[1,2,3]) # 세로축(인덱스)
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [13]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [14]:
df[["a"]]

   a
1  4
2  5
3  6

In [21]:
dates = pd.date_range('20220501', periods=6)
dates

DatetimeIndex(['2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06'],
              dtype='datetime64[ns]', freq='D')

In [26]:
datedd = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list("fuck"))
datedd

                   f         u         c         k
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [27]:
datedd.dtypes

f    float64
u    float64
c    float64
k    float64
dtype: object

In [29]:
datedd.head(3)

                   f         u         c         k
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985

In [30]:
datedd.tail()

                   f         u         c         k
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [35]:
datedd.columns
datedd.index

DatetimeIndex(['2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06'],
              dtype='datetime64[ns]', freq='D')

In [37]:
datedd.to_numpy()

array([[-0.01666826,  0.17546489, -1.31678968, -0.10142216],
       [-0.2758674 , -0.0796015 ,  0.65917846,  0.36479054],
       [ 1.47961624, -2.35021419, -1.15008294,  1.14098473],
       [-0.08221926,  0.42662021,  0.38804984,  0.56971937],
       [-1.7644239 , -0.13713649,  0.89209172, -0.74212267],
       [ 0.81509234, -0.80837429,  0.57809497, -0.41430487]])

In [38]:
df.to_numpy()

array([[ 4,  7, 10],
       [ 5,  8, 11],
       [ 6,  9, 12]], dtype=int64)

In [39]:
datedd

                   f         u         c         k
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [43]:
datedd.sort_index(axis=0, ascending=False)

                   f         u         c         k
2022-05-06  0.815092 -0.808374  0.578095 -0.414305
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422

In [58]:
datedd.sort_values(by='f')

                   f         u         c         k
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422
2022-05-06  0.815092 -0.808374  0.578095 -0.414305
2022-05-03  1.479616 -2.350214 -1.150083  1.140985

In [50]:
datedd['f']

2022-05-01   -0.016668
2022-05-02   -0.275867
2022-05-03    1.479616
2022-05-04   -0.082219
2022-05-05   -1.764424
2022-05-06    0.815092
Freq: D, Name: f, dtype: float64

In [55]:
datedd[1:3]

                   f         u         c         k
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985

In [59]:
datedd['f']

2022-05-01   -0.016668
2022-05-02   -0.275867
2022-05-03    1.479616
2022-05-04   -0.082219
2022-05-05   -1.764424
2022-05-06    0.815092
Freq: D, Name: f, dtype: float64

In [60]:
datedd['20220502':'20220506']

                   f         u         c         k
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [64]:
datedd

                   f         u         c         k
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [66]:
dates[0]

Timestamp('2022-05-01 00:00:00', freq='D')

In [70]:
datedd.loc['20220506']

f    0.815092
u   -0.808374
c    0.578095
k   -0.414305
Name: 2022-05-06 00:00:00, dtype: float64

In [71]:
datedd.loc[:, ['f','c']]

                   f         c
2022-05-01 -0.016668 -1.316790
2022-05-02 -0.275867  0.659178
2022-05-03  1.479616 -1.150083
2022-05-04 -0.082219  0.388050
2022-05-05 -1.764424  0.892092
2022-05-06  0.815092  0.578095

In [72]:
datedd.loc['20220501','f']

-0.01666826106520078

In [74]:
datedd

                   f         u         c         k
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [77]:
datedd.iloc[3,2]

0.3880498373244847

In [78]:
datedd.iloc[1:3,[0,2]]

                   f         c
2022-05-02 -0.275867  0.659178
2022-05-03  1.479616 -1.150083

In [79]:
datedd[datedd['f']>0]

                   f         u         c         k
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [80]:
datedd[datedd>0]

                   f         u         c         k
2022-05-01       NaN  0.175465       NaN       NaN
2022-05-02       NaN       NaN  0.659178  0.364791
2022-05-03  1.479616       NaN       NaN  1.140985
2022-05-04       NaN  0.426620  0.388050  0.569719
2022-05-05       NaN       NaN  0.892092       NaN
2022-05-06  0.815092       NaN  0.578095       NaN

In [81]:
df2 = datedd.copy()

In [83]:
df2

                   f         u         c         k
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422
2022-05-02 -0.275867 -0.079602  0.659178  0.364791
2022-05-03  1.479616 -2.350214 -1.150083  1.140985
2022-05-04 -0.082219  0.426620  0.388050  0.569719
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123
2022-05-06  0.815092 -0.808374  0.578095 -0.414305

In [84]:
df2['n']=['one', 'two', 'three', 'four', 'five', 'six']
df2

                   f         u         c         k      n
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422    one
2022-05-02 -0.275867 -0.079602  0.659178  0.364791    two
2022-05-03  1.479616 -2.350214 -1.150083  1.140985  three
2022-05-04 -0.082219  0.426620  0.388050  0.569719   four
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123   five
2022-05-06  0.815092 -0.808374  0.578095 -0.414305    six

In [85]:
df2[df2['n'].isin(['three','four'])]

                   f         u         c         k      n
2022-05-03  1.479616 -2.350214 -1.150083  1.140985  three
2022-05-04 -0.082219  0.426620  0.388050  0.569719   four

In [86]:
df2

                   f         u         c         k      n
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422    one
2022-05-02 -0.275867 -0.079602  0.659178  0.364791    two
2022-05-03  1.479616 -2.350214 -1.150083  1.140985  three
2022-05-04 -0.082219  0.426620  0.388050  0.569719   four
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123   five
2022-05-06  0.815092 -0.808374  0.578095 -0.414305    six

In [88]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [91]:
df2['y']=s1

In [92]:
df2

                   f         u         c         k      n   y
2022-05-01 -0.016668  0.175465 -1.316790 -0.101422    one NaN
2022-05-02 -0.275867 -0.079602  0.659178  0.364791    two NaN
2022-05-03  1.479616 -2.350214 -1.150083  1.140985  three NaN
2022-05-04 -0.082219  0.426620  0.388050  0.569719   four NaN
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123   five NaN
2022-05-06  0.815092 -0.808374  0.578095 -0.414305    six NaN

In [93]:
df2.loc[dates[0],'c']=0

In [94]:
df2

                   f         u         c         k      n   y
2022-05-01 -0.016668  0.175465  0.000000 -0.101422    one NaN
2022-05-02 -0.275867 -0.079602  0.659178  0.364791    two NaN
2022-05-03  1.479616 -2.350214 -1.150083  1.140985  three NaN
2022-05-04 -0.082219  0.426620  0.388050  0.569719   four NaN
2022-05-05 -1.764424 -0.137136  0.892092 -0.742123   five NaN
2022-05-06  0.815092 -0.808374  0.578095 -0.414305    six NaN